micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n647xx.h
  SDMMC1_IRQn                = 174,    /*!< SDMMC1 global interrupt                                                            */
  SDMMC2_IRQn                = 175,    /*!< SDMMC2 global interrupt                                                            */
  UCPD1_IRQn                 = 176,    /*!< UCPD1 global interrupt                                                             */
  USB1_OTG_HS_IRQn           = 177,    /*!< USB1 OTG HS interrupt                                                              */
  USB2_OTG_HS_IRQn           = 178,    /*!< USB2 OTG HS interrupt                                                              */
  ETH1_IRQn                  = 179,    /*!< ETH1 global interrupt                                                              */
  FDCAN1_IT0_IRQn            = 180,    /*!< FDCAN1 interrupt 0                                                                 */
  FDCAN1_IT1_IRQn            = 181,    /*!< FDCAN1 interrupt 1                                                                 */
  FDCAN2_IT0_IRQn            = 182,    /*!< FDCAN2 interrupt 0                                                                 */
  FDCAN2_IT1_IRQn            = 183,    /*!< FDCAN2 interrupt 1                                                                 */
  FDCAN3_IT0_IRQn            = 184,    /*!< FDCAN3 interrupt 0                                                                 */
  FDCAN3_IT1_IRQn            = 185,    /*!< FDCAN3 interrupt 1                                                                 */
  FDCAN_CU_IRQn              = 186,    /*!< FDCAN Clock Unit interrupt                                                         */
  MDIOS_IRQn                 = 187,    /*!< MDIOS global interrupt                                                             */
  DCMI_PSSI_IRQn             = 188,    /*!< DCMI/PSSI global interrupt                                                         */
  WAKEUP_PIN_IRQn            = 189,    /*!< Wake-up pins interrupt                                                             */
  CTI_INT0_IRQn              = 190,    /*!< CTI INT0 interrupt                                                                 */
  CTI_INT1_IRQn              = 191,    /*!< CTI INT1 interrupt                                                                 */
  LTDC_UP_IRQn               = 193,    /*!< LTDC up-layer global interrupt                                                     */
  LTDC_UP_ERR_IRQn           = 194,    /*!< LTDC up-layer error interrupt                                                      */
} IRQn_Type;


/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/**
  * @brief Configuration of the Cortex-M55 Processor and Core Peripherals
   */
#define __CM55_REV                0x0101U /*!< Cortex-M55 revision r1p1                      */
#define __FPU_PRESENT             1U      /*!< CM55 Floating Point Unit present              */
#define __DSP_PRESENT             1U      /*!< CM55 Digital Signal Processing Unit present   */
#define __MPU_PRESENT             1U      /*!< CM55 Memory Programming Unit present          */
#define __ICACHE_PRESENT          1U      /*!< CM55 Instruction cache present                */
#define __DCACHE_PRESENT          1U      /*!< CM55 Data cache present                       */
#define __VTOR_PRESENT            1U      /*!< CM55 Vector table offset register present     */
#define __PMU_PRESENT             1U      /*!< CM55 Performance Monitoring Unit present      */
#define __PMU_NUM_EVENTCNT        8U      /*!< CM55 can monitor up to 8 PMU events           */
#define __NVIC_PRIO_BITS          4U      /*!< CM55 uses 4 bits for the Priority Levels      */
#define __Vendor_SysTickConfig    0U      /*!< Set to 1 if different SysTick Config is used  */
#define __SAUREGION_PRESENT       1U      /*!< SAU regions present                           */

/** @} */ /* End of group Configuration_of_CMSIS */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define CPU_IN_SECURE_STATE
#endif

#define CPU_AS_TRUSTED_DOMAIN

#include "core_cm55.h"                    /*!< ARM Cortex-M55 processor and core peripherals */
#include "system_stm32n6xx.h"             /*!< STM32N6xx System */

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */

/** @addtogroup STM32N6xx_peripherals
  * @{
  */

/**
  * @brief Analog to Digital Converter (ADC)
  */
typedef struct
{
  __IO uint32_t ISR;           /*!< ADC interrupt and status register,                     Address offset: 0x00 */
  __IO uint32_t IER;           /*!< ADC interrupt enable register,                         Address offset: 0x04 */
  __IO uint32_t CR;            /*!< ADC control register,                                  Address offset: 0x08 */
  __IO uint32_t CFGR1;         /*!< ADC configuration register 1,                          Address offset: 0x0C */
  __IO uint32_t CFGR2;         /*!< ADC configuration register 2,                          Address offset: 0x10 */
  __IO uint32_t SMPR1;         /*!< ADC sample time register 1,                            Address offset: 0x14 */
  __IO uint32_t SMPR2;         /*!< ADC sample time register 2,                            Address offset: 0x18 */
  __IO uint32_t PCSEL;         /*!< ADC channel preselection register,                     Address offset: 0x1C */
  uint32_t      RESERVED1[4];  /*!< Reserved,                                              Address offset: 0x020-0x02C */
  __IO uint32_t SQR1;          /*!< ADC regular sequence register 1,                       Address offset: 0x30 */
  __IO uint32_t SQR2;          /*!< ADC regular sequence register 2,                       Address offset: 0x34 */
  __IO uint32_t SQR3;          /*!< ADC regular sequence register 3,                       Address offset: 0x38 */
  __IO uint32_t SQR4;          /*!< ADC regular sequence register 4,                       Address offset: 0x3C */
  __IO uint32_t DR;            /*!< ADC regular data register,                             Address offset: 0x40 */
  uint32_t      RESERVED2[2];  /*!< Reserved,                                              Address offset: 0x044-0x048 */
  __IO uint32_t JSQR;          /*!< ADC injected sequence register,                        Address offset: 0x4C */
  __IO uint32_t OFCFGR1;       /*!< ADC offset configuration register 1,                   Address offset: 0x50 */
  __IO uint32_t OFCFGR2;       /*!< ADC offset configuration register 2,                   Address offset: 0x54 */
  __IO uint32_t OFCFGR3;       /*!< ADC offset configuration register 3,                   Address offset: 0x58 */
  __IO uint32_t OFCFGR4;       /*!< ADC offset configuration register 4,                   Address offset: 0x5C */
  __IO uint32_t OFR1;          /*!< ADC offset register 1,                                 Address offset: 0x60 */
  __IO uint32_t OFR2;          /*!< ADC offset register 2,                                 Address offset: 0x64 */
  __IO uint32_t OFR3;          /*!< ADC offset register 3,                                 Address offset: 0x68 */
  __IO uint32_t OFR4;          /*!< ADC offset register 4,                                 Address offset: 0x6C */
  __IO uint32_t GCOMP;         /*!< ADC gain compensation register,                        Address offset: 0x70 */
  uint32_t      RESERVED3[3];  /*!< Reserved,                                              Address offset: 0x074-0x07C */
  __IO uint32_t JDR1;          /*!< ADC injected data register 1,                          Address offset: 0x80 */
  __IO uint32_t JDR2;          /*!< ADC injected data register 2,                          Address offset: 0x84 */
  __IO uint32_t JDR3;          /*!< ADC injected data register 3,                          Address offset: 0x88 */
  __IO uint32_t JDR4;          /*!< ADC injected data register 4,                          Address offset: 0x8C */
  uint32_t      RESERVED4[4];  /*!< Reserved,                                              Address offset: 0x090-0x09C */
  __IO uint32_t AWD2CR;        /*!< ADC analog watchdog 2 configuration register,          Address offset: 0xA0 */
  __IO uint32_t AWD3CR;        /*!< ADC analog watchdog 3 configuration register,          Address offset: 0xA4 */
  __IO uint32_t AWD1LTR;       /*!< ADC analog watchdog 1 low threshold register,          Address offset: 0xA8 */
  __IO uint32_t AWD1HTR;       /*!< ADC analog watchdog 1 high threshold register,         Address offset: 0xAC */
  __IO uint32_t AWD2LTR;       /*!< ADC analog watchdog 2 low threshold register,          Address offset: 0xB0 */
  __IO uint32_t AWD2HTR;       /*!< ADC analog watchdog 2 high threshold register,         Address offset: 0xB4 */
  __IO uint32_t AWD3LTR;       /*!< ADC analog watchdog 3 low threshold register,          Address offset: 0xB8 */
  __IO uint32_t AWD3HTR;       /*!< ADC analog watchdog 3 high threshold register,         Address offset: 0xBC */
  __IO uint32_t DIFSEL;        /*!< ADC differential mode selection register,              Address offset: 0xC0 */
  __IO uint32_t CALFACT;       /*!< ADC calibration factors,                               Address offset: 0xC4 */
  uint32_t      RESERVED5[2];  /*!< Reserved,                                              Address offset: 0x0C8-0x0CC */
  __IO uint32_t OR;            /*!< ADC option register,                                   Address offset: 0xD0 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;           /*!< ADC common status register,                            Address offset: 0x300 */
  uint32_t RESERVED;           /*!< Reserved,                                              Address offset: 0x304 */
  __IO uint32_t CCR;           /*!< ADC common control register,                           Address offset: 0x308 */
  __IO uint32_t CDR;           /*!< ADC common regular data register for dual mode,        Address offset: 0x30C */
  __IO uint32_t CDR2;          /*!< ADC common regular data register for dual mode 32-bit, Address offset: 0x310 */
} ADC_Common_TypeDef;

/**
  * @brief Boot and Security
  */

typedef struct
{
  __IO uint32_t FVRw[384];       /*!< BSEC fuse word (0-383) value register,       Address offset: 0x000-0x5FC */
       uint32_t RESERVED0[128];  /*!< Reserved,                                    Address offset: 0x600-0x7FC */
  __IO uint32_t SPLOCKx[12];     /*!< BSEC sticky program lock register (0-11),    Address offset: 0x800-0x82C */
       uint32_t RESERVED1[4];    /*!< Reserved,                                    Address offset: 0x830-0x83C */
  __IO uint32_t SWLOCKx[12];     /*!< BSEC sticky write lock register (0-11),      Address offset: 0x840-0x86C */
       uint32_t RESERVED2[4];    /*!< Reserved,                                    Address offset: 0x870-0x87C */
  __IO uint32_t SRLOCKx[12];     /*!< BSEC sticky reload lock register (0-11),     Address offset: 0x880-0x8AC */
       uint32_t RESERVED3[4];    /*!< Reserved,                                    Address offset: 0x8B0-0x8BC */
  __IO uint32_t OTPVLDRx[12];    /*!< BSEC OTP valid register (0-11),              Address offset: 0x8C0-0x8EC */
       uint32_t RESERVED4[20];   /*!< Reserved,                                    Address offset: 0x8F0-0x93C */
  __IO uint32_t SFSRx[12];       /*!< BSEC shadowed fuses status register (0-11),  Address offset: 0x940-0x96C */
       uint32_t RESERVED5[165];  /*!< Reserved,                                    Address offset: 0x970-0xC00 */
  __IO uint32_t OTPCR;           /*!< BSEC OTP control register,                   Address offset: 0xC04 */
  __IO uint32_t WDR;             /*!< BSEC write data register,                    Address offset: 0xC08 */
       uint32_t RESERVED6[125];  /*!< Reserved,                                    Address offset: 0xC0C-0xDFC */
  __IO uint32_t SCRATCHRx[4];    /*!< BSEC scratch register (0-3),                 Address offset: 0xE00-0xE0C */
  __IO uint32_t LOCKR;           /*!< BSEC lock register,                          Address offset: 0xE10 */
  __IO uint32_t JTAGINR;         /*!< BSEC JTAG input register,                    Address offset: 0xE14 */
  __IO uint32_t JTAGOUTR;        /*!< BSEC JTAG output register,                   Address offset: 0xE18 */
       uint32_t RESERVED7[2];    /*!< Reserved,                                    Address offset: 0xE1C-0xE20 */
  __IO uint32_t UNMAPR;          /*!< BSEC unmap register,                         Address offset: 0xE24 */
       uint32_t RESERVED8[6];    /*!< Reserved,                                    Address offset: 0xE28-0xE3C */
  __IO uint32_t SR;              /*!< BSEC status register,                        Address offset: 0xE40 */
  __IO uint32_t OTPSR;           /*!< BSEC OTP status register,                    Address offset: 0xE44 */
       uint32_t RESERVED9[14];   /*!< Reserved,                                    Address offset: 0xE48-0xE7C */
  __IO uint32_t EPOCHRx[2];      /*!< BSEC epoch register (0-1),                   Address offset: 0xE80-0xE84 */
  __IO uint32_t EPOCHSELR;       /*!< BSEC epoch select register,                  Address offset: 0xE88 */
  __IO uint32_t DBGCR;           /*!< BSEC debug control register,                 Address offset: 0xE8C */
  __IO uint32_t AP_UNLOCK;       /*!< BSEC AP unlock,                              Address offset: 0xE90 */
  __IO uint32_t HDPLSR;          /*!< BSEC hide protection level status register,  Address offset: 0xE94 */
  __IO uint32_t HDPLCR;          /*!< BSEC hide protection level control register, Address offset: 0xE98 */
  __IO uint32_t NEXTLR;          /*!< BSEC next hide protection level register,    Address offset: 0xE9C */
       uint32_t RESERVED10[40];  /*!< Reserved,                                    Address offset: 0xEA0-0xF3C */
  __IO uint32_t WOSCRx[8];       /*!< BSEC write once scratch register (0-7),      Address offset: 0xF40-0xF5C */
       uint32_t RESERVED11[34];  /*!< Reserved,                                    Address offset: 0xF60-0xFE4 */
  __IO uint32_t HRCR;            /*!< BSEC hot reset count register,               Address offset: 0xFE8 */
  __IO uint32_t WRCR;            /*!< BSEC warm reset count register,              Address offset: 0xFEC */
} BSEC_TypeDef;

/**
  * @brief Axi Cache
  */
typedef struct
{
  __IO uint32_t CR1;            /*!< CACHEAXI control register 1,                   Address offset: 0x00 */
  __IO uint32_t SR;             /*!< CACHEAXI status register,                      Address offset: 0x04 */
  __IO uint32_t IER;            /*!< CACHEAXI interrupt enable register,            Address offset: 0x08 */
  __IO uint32_t FCR;            /*!< CACHEAXI flag clear register,                  Address offset: 0x0C */
  __IO uint32_t RHMONR;         /*!< CACHEAXI read hit monitor register,            Address offset: 0x10 */
  __IO uint32_t RMMONR;         /*!< CACHEAXI read miss monitor register,           Address offset: 0x14 */
  __IO uint32_t RAMMONR;        /*!< CACHEAXI read-allocate miss monitor register,  Address offset: 0x18 */
  __IO uint32_t EVIMONR;        /*!< CACHEAXI eviction monitor register,            Address offset: 0x1C */
  __IO uint32_t WHMONR;         /*!< CACHEAXI write-hit monitor register,           Address offset: 0x20 */
  __IO uint32_t WMMONR;         /*!< CACHEAXI write-miss monitor register,          Address offset: 0x24 */
  __IO uint32_t WAMMONR;        /*!< CACHEAXI write-allocate miss monitor register, Address offset: 0x28 */
  __IO uint32_t WTMONR;         /*!< CACHEAXI write-through monitor register,       Address offset: 0x2C */
       uint32_t RESERVED1[52];  /*!< Reserved,                                      Address offset: 0x30-0xFC */
  __IO uint32_t CR2;            /*!< CACHEAXI control register 2,                   Address offset: 0x100 */
  __IO uint32_t CMDRSADDRR;     /*!< CACHEAXI command start address register,       Address offset: 0x104 */
  __IO uint32_t CMDREADDRR;     /*!< CACHEAXI command end address register,         Address offset: 0x108 */
} CACHEAXI_TypeDef;

/**
  * @brief CRC calculation unit
  */
typedef struct
{
  __IO uint32_t DR;            /*!< CRC Data register,                              Address offset: 0x00 */
  __IO uint32_t IDR;           /*!< CRC Independent data register,                  Address offset: 0x04 */
  __IO uint32_t CR;            /*!< CRC Control register,                           Address offset: 0x08 */
       uint32_t RESERVED1;     /*!< Reserved,                                                       0x0C */
  __IO uint32_t INIT;          /*!< Initial CRC value register,                     Address offset: 0x10 */
  __IO uint32_t POL;           /*!< CRC polynomial register,                        Address offset: 0x14 */
} CRC_TypeDef;


