micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n647xx.h
#define FMC_BASE                        0x60000000UL /*!< Base address of : FMC NOR/RAM memories accessible over AXI */
#define FMC_BANK1                       FMC_BASE
#define FMC_BANK1_1                     FMC_BANK1
#define FMC_BANK1_2                     (FMC_BANK1 + 0x04000000UL)
#define FMC_BANK1_3                     (FMC_BANK1 + 0x08000000UL)
#define FMC_BANK1_4                     (FMC_BANK1 + 0x0C000000UL)
#define FMC_BANK5                       0xC0000000UL  /*!< Base address of : FMC SDRAM memories accessible over AXI */
#define FMC_BANK5_1                     FMC_BANK5
#define FMC_BANK5_2                     (FMC_BANK5 + 0x04000000UL)
#define FMC_BANK5_3                     (FMC_BANK5 + 0x08000000UL)
#define FMC_BANK5_4                     (FMC_BANK5 + 0x0C000000UL)
#define FMC_BANK6                       0xD0000000UL  /*!< Base address of : FMC SDRAM memories accessible over AXI */
#define FMC_BANK6_1                     FMC_BANK6
#define FMC_BANK6_2                     (FMC_BANK6 + 0x04000000UL)
#define FMC_BANK6_3                     (FMC_BANK6 + 0x08000000UL)
#define FMC_BANK6_4                     (FMC_BANK6 + 0x0C000000UL)
#define XSPI1_BASE                      0x90000000UL /*!< Base address of : XSPI1 memories accessible over AXI    */
#define XSPI2_BASE                      0x70000000UL /*!< Base address of : XSPI2 memories accessible over AXI    */
#define XSPI3_BASE                      0x80000000UL /*!< Base address of : XSPI3 memories accessible over AXI    */

/**************************************************************************/
/*                                                                        */
/* Peripheral and internal SRAMs base addresses - Non secure (aliased_NS) */
/*                                                                        */
/**************************************************************************/

#define ITCM_BASE_NS                    0x00000000UL /*!< Base address of ITCM from 64 KB up to 256 KB               */
#define BOOTROM_BASE_NS                 0x08000000UL /*!< Base address of 128 KB boot ROM accessible over AXI        */
#define DTCM_BASE_NS                    0x20000000UL /*!< Base address of DTCM from 128 KB up to 256 KB              */
#define SRAM1_AXI_BASE_NS               0x24000000UL /*!< Base address of up to 1 MB system RAM 1 accessible over AXI */
#define SRAM2_AXI_BASE_NS               0x24100000UL /*!< Base address of 1 MB system RAM 2 accessible over AXI      */
#define SRAM3_AXI_BASE_NS               0x24200000UL /*!< Base address of 448 KB system RAM 3 accessible over AXI      */
#define SRAM4_AXI_BASE_NS               0x24270000UL /*!< Base address of 448 KB system RAM 4 accessible over AXI */
#define SRAM5_AXI_BASE_NS               0x242E0000UL /*!< Base address of 448 KB system RAM 5 accessible over AXI */
#define SRAM6_AXI_BASE_NS               0x24350000UL /*!< Base address of 448 KB system RAM 6 accessible over AXI */
#define SRAM_AXI_BASE_NS                SRAM1_AXI_BASE_NS /*!< Base address of 3.792 MB system RAM accessible over AXI */
#define CACHEAXI_RAM_BASE_NS            0x243C0000UL /*!< Base address of 256 KB NPU Cache RAM accessible over AXI   */
#define VENC_RAM_BASE_NS                0x24400000UL /*!< Base address of 128 KB of Video Encoder RAM accessible over AXI */
#define GFXMMU_VIRTUAL_BUFFER0_BASE_NS  0x25000000UL /*!< Base address of 4 MB GFXMMU virtual buffer 0               */
#define GFXMMU_VIRTUAL_BUFFER1_BASE_NS  0x25400000UL /*!< Base address of 4 MB GFXMMU virtual buffer 1               */
#define GFXMMU_VIRTUAL_BUFFER2_BASE_NS  0x25800000UL /*!< Base address of 4 MB GFXMMU virtual buffer 2               */
#define GFXMMU_VIRTUAL_BUFFER3_BASE_NS  0x25C00000UL /*!< Base address of 4 MB GFXMMU virtual buffer 3               */
#define STM500_CHANNELS_BASE_NS         0x27F00000UL /*!< Base address of 1 MB of STM500 Channels (System Trace)     */
#define SRAM1_AHB_BASE_NS               0x28000000UL /*!< Base address of 16 KB system RAM 1 over AXI->AHB Bridge    */
#define SRAM2_AHB_BASE_NS               0x28004000UL /*!< Base address of 16 KB system RAM 2 over AXI->AHB Bridge    */
#define SRAM_AHB_BASE_NS                SRAM1_AHB_BASE_NS /*!< Base address of 32 KB system RAM over AXI->AHB Bridge */
#define BKPSRAM_BASE_NS                 0x2C000000UL /*!< Base address of 8 KB Backup SRAM over AXI->AHB Bridge      */
#define PERIPH_BASE_NS                  0x40000000UL /*!< Base address of : AHB/APB Peripherals                      */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE_NS              PERIPH_BASE_NS
#define AHB1PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00020000UL)
#define APB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x02000000UL)
#define AHB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x02020000UL)
#define APB3PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x04000000UL)
#define AHB3PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x04020000UL)
#define APB4PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x06000000UL)
#define AHB4PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x06020000UL)
#define APB5PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x08000000UL)
#define AHB5PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x08020000UL)

/*!< APB1 peripherals */
#define TIM2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x0000UL)
#define TIM3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x0400UL)
#define TIM4_BASE_NS                    (APB1PERIPH_BASE_NS + 0x0800UL)
#define TIM5_BASE_NS                    (APB1PERIPH_BASE_NS + 0x0C00UL)
#define TIM6_BASE_NS                    (APB1PERIPH_BASE_NS + 0x1000UL)
#define TIM7_BASE_NS                    (APB1PERIPH_BASE_NS + 0x1400UL)
#define TIM12_BASE_NS                   (APB1PERIPH_BASE_NS + 0x1800UL)
#define TIM13_BASE_NS                   (APB1PERIPH_BASE_NS + 0x1C00UL)
#define TIM14_BASE_NS                   (APB1PERIPH_BASE_NS + 0x2000UL)
#define LPTIM1_BASE_NS                  (APB1PERIPH_BASE_NS + 0x2400UL)
#define WWDG_BASE_NS                    (APB1PERIPH_BASE_NS + 0x2C00UL)
#define TIM10_BASE_NS                   (APB1PERIPH_BASE_NS + 0x3000UL)
#define TIM11_BASE_NS                   (APB1PERIPH_BASE_NS + 0x3400UL)
#define SPI2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x3800UL)
#define SPI3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x3C00UL)
#define SPDIFRX_BASE_NS                 (APB1PERIPH_BASE_NS + 0x4000UL)
#define USART2_BASE_NS                  (APB1PERIPH_BASE_NS + 0x4400UL)
#define USART3_BASE_NS                  (APB1PERIPH_BASE_NS + 0x4800UL)
#define UART4_BASE_NS                   (APB1PERIPH_BASE_NS + 0x4C00UL)
#define UART5_BASE_NS                   (APB1PERIPH_BASE_NS + 0x5000UL)
#define I2C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x5400UL)
#define I2C2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x5800UL)
#define I2C3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x5C00UL)
#define I3C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x6000UL)
#define I3C2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x6400UL)
#define UART7_BASE_NS                   (APB1PERIPH_BASE_NS + 0x7800UL)
#define UART8_BASE_NS                   (APB1PERIPH_BASE_NS + 0x7C00UL)
#define MDIOS_BASE_NS                   (APB1PERIPH_BASE_NS + 0x9400UL)
#define FDCAN1_BASE_NS                  (APB1PERIPH_BASE_NS + 0xA000UL)
#define FDCAN2_BASE_NS                  (APB1PERIPH_BASE_NS + 0xA400UL)
#define FDCAN_CCU_BASE_NS               (APB1PERIPH_BASE_NS + 0xA800UL)
#define SRAMCAN_BASE_NS                 (APB1PERIPH_BASE_NS + 0xC000UL)
#define FDCAN3_BASE_NS                  (APB1PERIPH_BASE_NS + 0xE800UL)
#define UCPD1_BASE_NS                   (APB1PERIPH_BASE_NS + 0xFC00UL)

/*!< AHB1 peripherals */
#define GPDMA1_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x1000UL)
#define GPDMA1_Channel0_BASE_NS         (GPDMA1_BASE_NS + 0x0050UL)
#define GPDMA1_Channel1_BASE_NS         (GPDMA1_BASE_NS + 0x00D0UL)
#define GPDMA1_Channel2_BASE_NS         (GPDMA1_BASE_NS + 0x0150UL)
#define GPDMA1_Channel3_BASE_NS         (GPDMA1_BASE_NS + 0x01D0UL)
#define GPDMA1_Channel4_BASE_NS         (GPDMA1_BASE_NS + 0x0250UL)
#define GPDMA1_Channel5_BASE_NS         (GPDMA1_BASE_NS + 0x02D0UL)
#define GPDMA1_Channel6_BASE_NS         (GPDMA1_BASE_NS + 0x0350UL)
#define GPDMA1_Channel7_BASE_NS         (GPDMA1_BASE_NS + 0x03D0UL)
#define GPDMA1_Channel8_BASE_NS         (GPDMA1_BASE_NS + 0x0450UL)
#define GPDMA1_Channel9_BASE_NS         (GPDMA1_BASE_NS + 0x04D0UL)
#define GPDMA1_Channel10_BASE_NS        (GPDMA1_BASE_NS + 0x0550UL)
#define GPDMA1_Channel11_BASE_NS        (GPDMA1_BASE_NS + 0x05D0UL)
#define GPDMA1_Channel12_BASE_NS        (GPDMA1_BASE_NS + 0x0650UL)
#define GPDMA1_Channel13_BASE_NS        (GPDMA1_BASE_NS + 0x06D0UL)
#define GPDMA1_Channel14_BASE_NS        (GPDMA1_BASE_NS + 0x0750UL)
#define GPDMA1_Channel15_BASE_NS        (GPDMA1_BASE_NS + 0x07D0UL)
#define ADC1_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x2000UL)
#define ADC2_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x2100UL)
#define ADC12_COMMON_BASE_NS            (AHB1PERIPH_BASE_NS + 0x2300UL)

/*!< APB2 peripherals */
#define TIM1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x0000UL)
#define TIM8_BASE_NS                    (APB2PERIPH_BASE_NS + 0x0400UL)
#define USART1_BASE_NS                  (APB2PERIPH_BASE_NS + 0x1000UL)
#define USART6_BASE_NS                  (APB2PERIPH_BASE_NS + 0x1400UL)
#define UART9_BASE_NS                   (APB2PERIPH_BASE_NS + 0x1800UL)
#define USART10_BASE_NS                 (APB2PERIPH_BASE_NS + 0x1C00UL)
#define SPI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x3000UL)
#define SPI4_BASE_NS                    (APB2PERIPH_BASE_NS + 0x3400UL)
#define TIM18_BASE_NS                   (APB2PERIPH_BASE_NS + 0x3C00UL)
#define TIM15_BASE_NS                   (APB2PERIPH_BASE_NS + 0x4000UL)
#define TIM16_BASE_NS                   (APB2PERIPH_BASE_NS + 0x4400UL)
#define TIM17_BASE_NS                   (APB2PERIPH_BASE_NS + 0x4800UL)
#define TIM9_BASE_NS                    (APB2PERIPH_BASE_NS + 0x4C00UL)
#define SPI5_BASE_NS                    (APB2PERIPH_BASE_NS + 0x5000UL)
#define SAI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x5800UL)
#define SAI1_Block_A_BASE_NS            (SAI1_BASE_NS + 0x0004UL)
#define SAI1_Block_B_BASE_NS            (SAI1_BASE_NS + 0x0024UL)
#define SAI2_BASE_NS                    (APB2PERIPH_BASE_NS + 0x5C00UL)
#define SAI2_Block_A_BASE_NS            (SAI2_BASE_NS + 0x0004UL)
#define SAI2_Block_B_BASE_NS            (SAI2_BASE_NS + 0x0024UL)

/*!< AHB2 peripherals */
#define RAMCFG_BASE_NS                  (AHB2PERIPH_BASE_NS + 0x3000UL)
#define RAMCFG_SRAM1_AXI_BASE_NS        (RAMCFG_BASE_NS)
#define RAMCFG_SRAM2_AXI_BASE_NS        (RAMCFG_BASE_NS + 0x0080UL)
#define RAMCFG_SRAM3_AXI_BASE_NS        (RAMCFG_BASE_NS + 0x0100UL)
#define RAMCFG_SRAM4_AXI_BASE_NS        (RAMCFG_BASE_NS + 0x0180UL)
#define RAMCFG_SRAM5_AXI_BASE_NS        (RAMCFG_BASE_NS + 0x0200UL)
#define RAMCFG_SRAM6_AXI_BASE_NS        (RAMCFG_BASE_NS + 0x0280UL)
#define RAMCFG_SRAM1_AHB_BASE_NS        (RAMCFG_BASE_NS + 0x0300UL)
#define RAMCFG_SRAM2_AHB_BASE_NS        (RAMCFG_BASE_NS + 0x0380UL)
#define RAMCFG_VENC_RAM_BASE_NS         (RAMCFG_BASE_NS + 0x0400UL)
#define RAMCFG_BKPSRAM_BASE_NS          (RAMCFG_BASE_NS + 0x0480UL)
#define RAMCFG_FLEXRAM_BASE_NS          (RAMCFG_BASE_NS + 0x0500UL)
#define MDF1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x5000UL)
#define MDF1_Filter0_BASE_NS            (MDF1_BASE_NS + 0x0080UL)
#define MDF1_Filter1_BASE_NS            (MDF1_BASE_NS + 0x0100UL)
#define MDF1_Filter2_BASE_NS            (MDF1_BASE_NS + 0x0180UL)
#define MDF1_Filter3_BASE_NS            (MDF1_BASE_NS + 0x0200UL)
#define MDF1_Filter4_BASE_NS            (MDF1_BASE_NS + 0x0280UL)
#define MDF1_Filter5_BASE_NS            (MDF1_BASE_NS + 0x0300UL)
#define ADF1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x6000UL)
#define ADF1_Filter0_BASE_NS            (ADF1_BASE_NS + 0x0080UL)

/*!< APB3 peripherals */
#define DAP_ROM_BASE_NS                 (APB3PERIPH_BASE_NS + 0x0000UL)
#define DBGMCU_BASE_NS                  (APB3PERIPH_BASE_NS + 0x1000UL)
#define DFT_APB_BASE_NS                 (APB3PERIPH_BASE_NS + 0x2000UL)

/*!< AHB3 peripherals */
#define RNG_BASE_NS                     (AHB3PERIPH_BASE_NS + 0x0000UL)
#define HASH_BASE_NS                    (AHB3PERIPH_BASE_NS + 0x0400UL)
#define HASH_DIGEST_BASE_NS             (AHB3PERIPH_BASE_NS + 0x0710UL)
#define PKA_BASE_NS                     (AHB3PERIPH_BASE_NS + 0x2000UL)
#define RIFSC_BASE_NS                   (AHB3PERIPH_BASE_NS + 0x4000UL)
#define RISAF1_BASE_NS                  (AHB3PERIPH_BASE_NS + 0x6000UL)
#define RISAF2_BASE_NS                  (AHB3PERIPH_BASE_NS + 0x7000UL)
#define RISAF3_BASE_NS                  (AHB3PERIPH_BASE_NS + 0x8000UL)
#define RISAF4_BASE_NS                  (AHB3PERIPH_BASE_NS + 0x9000UL)
#define RISAF5_BASE_NS                  (AHB3PERIPH_BASE_NS + 0xA000UL)
#define RISAF6_BASE_NS                  (AHB3PERIPH_BASE_NS + 0xB000UL)
#define RISAF7_BASE_NS                  (AHB3PERIPH_BASE_NS + 0xC000UL)
#define RISAF8_BASE_NS                  (AHB3PERIPH_BASE_NS + 0xD000UL)
#define RISAF9_BASE_NS                  (AHB3PERIPH_BASE_NS + 0xE000UL)
#define RISAF11_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x010000UL)
#define RISAF12_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x011000UL)
#define RISAF13_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x012000UL)
#define RISAF14_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x013000UL)
#define RISAF15_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x014000UL)
#define RISAF21_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x015000UL)
#define RISAF22_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x016000UL)
#define RISAF23_BASE_NS                 (AHB3PERIPH_BASE_NS + 0x017000UL)

/*!< APB4 peripherals */
#define HDP_BASE_NS                     (APB4PERIPH_BASE_NS + 0x0800UL)
#define LPUART1_BASE_NS                 (APB4PERIPH_BASE_NS + 0x0C00UL)
#define SPI6_BASE_NS                    (APB4PERIPH_BASE_NS + 0x1400UL)
#define I2C4_BASE_NS                    (APB4PERIPH_BASE_NS + 0x1C00UL)
#define LPTIM2_BASE_NS                  (APB4PERIPH_BASE_NS + 0x2400UL)
#define LPTIM3_BASE_NS                  (APB4PERIPH_BASE_NS + 0x2800UL)
#define LPTIM4_BASE_NS                  (APB4PERIPH_BASE_NS + 0x2C00UL)
#define LPTIM5_BASE_NS                  (APB4PERIPH_BASE_NS + 0x3000UL)
#define VREFBUF_BASE_NS                 (APB4PERIPH_BASE_NS + 0x3C00UL)
#define RTC_BASE_NS                     (APB4PERIPH_BASE_NS + 0x4000UL)
#define TAMP_BASE_NS                    (APB4PERIPH_BASE_NS + 0x4400UL)
#define IWDG_BASE_NS                    (APB4PERIPH_BASE_NS + 0x4800UL)
#define SERC_BASE_NS                    (APB4PERIPH_BASE_NS + 0x7C00UL)
#define SYSCFG_BASE_NS                  (APB4PERIPH_BASE_NS + 0x8000UL)
#define BSEC_BASE_NS                    (APB4PERIPH_BASE_NS + 0x9000UL)
#define DTS_BASE_NS                     (APB4PERIPH_BASE_NS + 0xA000UL)
#define DTS_Sensor0_BASE_NS             (DTS_BASE_NS + 0x0C0UL)
#define DTS_Sensor1_BASE_NS             (DTS_BASE_NS + 0x100UL)

/*!< AHB4 peripherals */
#define GPIOA_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x0000UL)
#define GPIOB_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x0400UL)
#define GPIOC_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x0800UL)
#define GPIOD_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x0C00UL)
#define GPIOE_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x1000UL)
#define GPIOF_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x1400UL)
#define GPIOG_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x1800UL)
#define GPIOH_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x1C00UL)
#define GPION_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x3400UL)
#define GPIOO_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x3800UL)
#define GPIOP_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x3C00UL)
#define GPIOQ_BASE_NS                   (AHB4PERIPH_BASE_NS + 0x4000UL)
#define PWR_BASE_NS                     (AHB4PERIPH_BASE_NS + 0x4800UL)
#define CRC_BASE_NS                     (AHB4PERIPH_BASE_NS + 0x4C00UL)
#define EXTI_BASE_NS                    (AHB4PERIPH_BASE_NS + 0x5000UL)
#define RCC_BASE_NS                     (AHB4PERIPH_BASE_NS + 0x8000UL)

/*!< APB5 peripherals */
#define LTDC_BASE_NS                    (APB5PERIPH_BASE_NS + 0x1000UL)
#define LTDC_Layer1_BASE_NS             (LTDC_BASE_NS + 0x0100UL)
#define LTDC_Layer2_BASE_NS             (LTDC_BASE_NS + 0x0200UL)
#define DCMIPP_BASE_NS                  (APB5PERIPH_BASE_NS + 0x2000UL)
#define GFXTIM_BASE_NS                  (APB5PERIPH_BASE_NS + 0x4000UL)
#define VENC_BASE_NS                    (APB5PERIPH_BASE_NS + 0x5000UL)
#define CSI_BASE_NS                     (APB5PERIPH_BASE_NS + 0x6000UL)

/*!< AHB5 peripherals */
#define HPDMA1_BASE_NS                  (AHB5PERIPH_BASE_NS + 0x0000UL)
#define HPDMA1_Channel0_BASE_NS         (HPDMA1_BASE_NS + 0x0050UL)
#define HPDMA1_Channel1_BASE_NS         (HPDMA1_BASE_NS + 0x00D0UL)
#define HPDMA1_Channel2_BASE_NS         (HPDMA1_BASE_NS + 0x0150UL)
#define HPDMA1_Channel3_BASE_NS         (HPDMA1_BASE_NS + 0x01D0UL)
#define HPDMA1_Channel4_BASE_NS         (HPDMA1_BASE_NS + 0x0250UL)
#define HPDMA1_Channel5_BASE_NS         (HPDMA1_BASE_NS + 0x02D0UL)
#define HPDMA1_Channel6_BASE_NS         (HPDMA1_BASE_NS + 0x0350UL)
#define HPDMA1_Channel7_BASE_NS         (HPDMA1_BASE_NS + 0x03D0UL)
#define HPDMA1_Channel8_BASE_NS         (HPDMA1_BASE_NS + 0x0450UL)
#define HPDMA1_Channel9_BASE_NS         (HPDMA1_BASE_NS + 0x04D0UL)
#define HPDMA1_Channel10_BASE_NS        (HPDMA1_BASE_NS + 0x0550UL)
#define HPDMA1_Channel11_BASE_NS        (HPDMA1_BASE_NS + 0x05D0UL)
#define HPDMA1_Channel12_BASE_NS        (HPDMA1_BASE_NS + 0x0650UL)
#define HPDMA1_Channel13_BASE_NS        (HPDMA1_BASE_NS + 0x06D0UL)
#define HPDMA1_Channel14_BASE_NS        (HPDMA1_BASE_NS + 0x0750UL)
#define HPDMA1_Channel15_BASE_NS        (HPDMA1_BASE_NS + 0x07D0UL)
#define DMA2D_BASE_NS                   (AHB5PERIPH_BASE_NS + 0x1000UL)
#define JPEG_BASE_NS                    (AHB5PERIPH_BASE_NS + 0x3000UL)
#define FMC_R_BASE_NS                   (AHB5PERIPH_BASE_NS + 0x4000UL)
#define FMC_Bank1_R_BASE_NS             (FMC_R_BASE_NS + 0x0000UL)
#define FMC_Bank1E_R_BASE_NS            (FMC_R_BASE_NS + 0x0104UL)
#define FMC_Bank3_R_BASE_NS             (FMC_R_BASE_NS + 0x0080UL)
#define FMC_Bank5_6_R_BASE_NS           (FMC_R_BASE_NS + 0x0140UL)
#define FMC_Common_R_BASE_NS            (FMC_R_BASE_NS + 0x0020UL)
#define XSPI1_BASE_NS                   (AHB5PERIPH_BASE_NS + 0x5000UL)
#define PSSI_BASE_NS                    (AHB5PERIPH_BASE_NS + 0x6400UL)
#define SDMMC2_BASE_NS                  (AHB5PERIPH_BASE_NS + 0x6800UL)
#define DLYB_SDMMC2_BASE_NS             (AHB5PERIPH_BASE_NS + 0x6C00UL)
#define SDMMC1_BASE_NS                  (AHB5PERIPH_BASE_NS + 0x7000UL)
#define DLYB_SDMMC1_BASE_NS             (AHB5PERIPH_BASE_NS + 0x8000UL)
#define DCMI_BASE_NS                    (AHB5PERIPH_BASE_NS + 0x8400UL)
#define XSPI2_BASE_NS                   (AHB5PERIPH_BASE_NS + 0xA000UL)
#define XSPIM_BASE_NS                   (AHB5PERIPH_BASE_NS + 0xB400UL)
#define XSPI3_BASE_NS                   (AHB5PERIPH_BASE_NS + 0xD000UL)
#define GFXMMU_BASE_NS                  (AHB5PERIPH_BASE_NS + 0x010000UL)
#define GPU2D_BASE_NS                   (AHB5PERIPH_BASE_NS + 0x014000UL)
#define GPUCACHE_BASE_NS                (AHB5PERIPH_BASE_NS + 0x015000UL)
#define ICACHE_BASE_NS                  (AHB5PERIPH_BASE_NS + 0x015000UL)
#define ETH1_BASE_NS                    (AHB5PERIPH_BASE_NS + 0x016000UL)
#define ETH1_MAC_BASE_NS                (ETH1_BASE_NS)
#define USB1_HS_PHYC_BASE_NS            (AHB5PERIPH_BASE_NS + 0x01FC00UL)
#define USB2_HS_PHYC_BASE_NS            (AHB5PERIPH_BASE_NS + 0x0A0000UL)
#define USB1_OTG_HS_BASE_NS             (AHB5PERIPH_BASE_NS + 0x020000UL)
#define USB2_OTG_HS_BASE_NS             (AHB5PERIPH_BASE_NS + 0x060000UL)
#define CACHEAXI_BASE_NS                (AHB5PERIPH_BASE_NS + 0x0BFC00UL)
#define NPU_BASE_NS                     (AHB5PERIPH_BASE_NS + 0x0C0000UL)


