micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n647xx.h
#define GPDMA1_Channel11          GPDMA1_Channel11_NS
#define GPDMA1_Channel11_BASE     GPDMA1_Channel11_BASE_NS

#define GPDMA1_Channel12          GPDMA1_Channel12_NS
#define GPDMA1_Channel12_BASE     GPDMA1_Channel12_BASE_NS

#define GPDMA1_Channel13          GPDMA1_Channel13_NS
#define GPDMA1_Channel13_BASE     GPDMA1_Channel13_BASE_NS

#define GPDMA1_Channel14          GPDMA1_Channel14_NS
#define GPDMA1_Channel14_BASE     GPDMA1_Channel14_BASE_NS

#define GPDMA1_Channel15          GPDMA1_Channel15_NS
#define GPDMA1_Channel15_BASE     GPDMA1_Channel15_BASE_NS

#define GPIOA                     GPIOA_NS
#define GPIOA_BASE                GPIOA_BASE_NS

#define GPIOB                     GPIOB_NS
#define GPIOB_BASE                GPIOB_BASE_NS

#define GPIOC                     GPIOC_NS
#define GPIOC_BASE                GPIOC_BASE_NS

#define GPIOD                     GPIOD_NS
#define GPIOD_BASE                GPIOD_BASE_NS

#define GPIOE                     GPIOE_NS
#define GPIOE_BASE                GPIOE_BASE_NS

#define GPIOF                     GPIOF_NS
#define GPIOF_BASE                GPIOF_BASE_NS

#define GPIOG                     GPIOG_NS
#define GPIOG_BASE                GPIOG_BASE_NS

#define GPIOH                     GPIOH_NS
#define GPIOH_BASE                GPIOH_BASE_NS

#define GPION                     GPION_NS
#define GPION_BASE                GPION_BASE_NS

#define GPIOO                     GPIOO_NS
#define GPIOO_BASE                GPIOO_BASE_NS

#define GPIOP                     GPIOP_NS
#define GPIOP_BASE                GPIOP_BASE_NS

#define GPIOQ                     GPIOQ_NS
#define GPIOQ_BASE                GPIOQ_BASE_NS

#define GPU2D                     GPU2D_BASE_NS
#define GPU2D_BASE                GPU2D_BASE_NS

#define HASH                      HASH_NS
#define HASH_BASE                 HASH_BASE_NS

#define HASH_DIGEST               HASH_DIGEST_NS
#define HASH_DIGEST_BASE          HASH_DIGEST_BASE_NS

#define HPDMA1                    HPDMA1_NS
#define HPDMA1_BASE               HPDMA1_BASE_NS

#define HPDMA1_Channel0           HPDMA1_Channel0_NS
#define HPDMA1_Channel0_BASE      HPDMA1_Channel0_BASE_NS

#define HPDMA1_Channel1           HPDMA1_Channel1_NS
#define HPDMA1_Channel1_BASE      HPDMA1_Channel1_BASE_NS

#define HPDMA1_Channel2           HPDMA1_Channel2_NS
#define HPDMA1_Channel2_BASE      HPDMA1_Channel2_BASE_NS

#define HPDMA1_Channel3           HPDMA1_Channel3_NS
#define HPDMA1_Channel3_BASE      HPDMA1_Channel3_BASE_NS

#define HPDMA1_Channel4           HPDMA1_Channel4_NS
#define HPDMA1_Channel4_BASE      HPDMA1_Channel4_BASE_NS

#define HPDMA1_Channel5           HPDMA1_Channel5_NS
#define HPDMA1_Channel5_BASE      HPDMA1_Channel5_BASE_NS

#define HPDMA1_Channel6           HPDMA1_Channel6_NS
#define HPDMA1_Channel6_BASE      HPDMA1_Channel6_BASE_NS

#define HPDMA1_Channel7           HPDMA1_Channel7_NS
#define HPDMA1_Channel7_BASE      HPDMA1_Channel7_BASE_NS

#define HPDMA1_Channel8           HPDMA1_Channel8_NS
#define HPDMA1_Channel8_BASE      HPDMA1_Channel8_BASE_NS

#define HPDMA1_Channel9           HPDMA1_Channel9_NS
#define HPDMA1_Channel9_BASE      HPDMA1_Channel9_BASE_NS

#define HPDMA1_Channel10          HPDMA1_Channel10_NS
#define HPDMA1_Channel10_BASE     HPDMA1_Channel10_BASE_NS

#define HPDMA1_Channel11          HPDMA1_Channel11_NS
#define HPDMA1_Channel11_BASE     HPDMA1_Channel11_BASE_NS

#define HPDMA1_Channel12          HPDMA1_Channel12_NS
#define HPDMA1_Channel12_BASE     HPDMA1_Channel12_BASE_NS

#define HPDMA1_Channel13          HPDMA1_Channel13_NS
#define HPDMA1_Channel13_BASE     HPDMA1_Channel13_BASE_NS

#define HPDMA1_Channel14          HPDMA1_Channel14_NS
#define HPDMA1_Channel14_BASE     HPDMA1_Channel14_BASE_NS

#define HPDMA1_Channel15          HPDMA1_Channel15_NS
#define HPDMA1_Channel15_BASE     HPDMA1_Channel15_BASE_NS

#define I2C1                      I2C1_NS
#define I2C1_BASE                 I2C1_BASE_NS

#define I2C2                      I2C2_NS
#define I2C2_BASE                 I2C2_BASE_NS

#define I2C3                      I2C3_NS
#define I2C3_BASE                 I2C3_BASE_NS

#define I2C4                      I2C4_NS
#define I2C4_BASE                 I2C4_BASE_NS

#define I3C1                      I3C1_NS
#define I3C1_BASE                 I3C1_BASE_NS

#define I3C2                      I3C2_NS
#define I3C2_BASE                 I3C2_BASE_NS

#define ICACHE                    ICACHE_NS
#define ICACHE_BASE               ICACHE_BASE_NS

#define IWDG                      IWDG_NS
#define IWDG_BASE                 IWDG_BASE_NS

#define JPEG                      JPEG_NS
#define JPEG_BASE                 JPEG_BASE_NS

#define LPTIM1                    LPTIM1_NS
#define LPTIM1_BASE               LPTIM1_BASE_NS

#define LPTIM2                    LPTIM2_NS
#define LPTIM2_BASE               LPTIM2_BASE_NS

#define LPTIM3                    LPTIM3_NS
#define LPTIM3_BASE               LPTIM3_BASE_NS

#define LPTIM4                    LPTIM4_NS
#define LPTIM4_BASE               LPTIM4_BASE_NS

#define LPTIM5                    LPTIM5_NS
#define LPTIM5_BASE               LPTIM5_BASE_NS

#define LPUART1                   LPUART1_NS
#define LPUART1_BASE              LPUART1_BASE_NS

#define LTDC                      LTDC_NS
#define LTDC_BASE                 LTDC_BASE_NS

#define LTDC_Layer1               LTDC_Layer1_NS
#define LTDC_Layer1_BASE          LTDC_Layer1_BASE_NS

#define LTDC_Layer2               LTDC_Layer2_NS
#define LTDC_Layer2_BASE          LTDC_Layer2_BASE_NS


#define MDF1                      MDF1_NS
#define MDF1_BASE                 MDF1_BASE_NS

#define MDF1_Filter0              MDF1_Filter0_NS
#define MDF1_Filter0_BASE         MDF1_Filter0_BASE_NS

#define MDF1_Filter1              MDF1_Filter1_NS
#define MDF1_Filter1_BASE         MDF1_Filter1_BASE_NS

#define MDF1_Filter2              MDF1_Filter2_NS
#define MDF1_Filter2_BASE         MDF1_Filter2_BASE_NS

#define MDF1_Filter3              MDF1_Filter3_NS
#define MDF1_Filter3_BASE         MDF1_Filter3_BASE_NS

