micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n647xx.h
#define MDF1_Filter4              MDF1_Filter4_NS
#define MDF1_Filter4_BASE         MDF1_Filter4_BASE_NS

#define MDF1_Filter5              MDF1_Filter5_NS
#define MDF1_Filter5_BASE         MDF1_Filter5_BASE_NS

#define MDIOS                     MDIOS_NS
#define MDIOS_BASE                MDIOS_BASE_NS

#define NPU_PRESENT
#define NPU_BASE                  NPU_BASE_NS

#define PKA                       PKA_NS
#define PKA_BASE                  PKA_BASE_NS

#define PSSI                      PSSI_NS
#define PSSI_BASE                 PSSI_BASE_NS

#define PWR                       PWR_NS
#define PWR_BASE                  PWR_BASE_NS

#define RAMCFG                    RAMCFG_NS
#define RAMCFG_BASE               RAMCFG_BASE_NS

#define RAMCFG_SRAM1_AXI          RAMCFG_SRAM1_AXI_NS
#define RAMCFG_SRAM1_AXI_BASE     RAMCFG_SRAM1_AXI_BASE_NS

#define RAMCFG_SRAM2_AXI          RAMCFG_SRAM2_AXI_NS
#define RAMCFG_SRAM2_AXI_BASE     RAMCFG_SRAM2_AXI_BASE_NS

#define RAMCFG_SRAM3_AXI          RAMCFG_SRAM3_AXI_NS
#define RAMCFG_SRAM3_AXI_BASE     RAMCFG_SRAM3_AXI_BASE_NS

#define RAMCFG_SRAM4_AXI          RAMCFG_SRAM4_AXI_NS
#define RAMCFG_SRAM4_AXI_BASE     RAMCFG_SRAM4_AXI_BASE_NS

#define RAMCFG_SRAM5_AXI          RAMCFG_SRAM5_AXI_NS
#define RAMCFG_SRAM5_AXI_BASE     RAMCFG_SRAM5_AXI_BASE_NS

#define RAMCFG_SRAM6_AXI          RAMCFG_SRAM6_AXI_NS
#define RAMCFG_SRAM6_AXI_BASE     RAMCFG_SRAM6_AXI_BASE_NS

#define RAMCFG_SRAM1_AHB          RAMCFG_SRAM1_AHB_NS
#define RAMCFG_SRAM1_AHB_BASE     RAMCFG_SRAM1_AHB_BASE_NS

#define RAMCFG_SRAM2_AHB          RAMCFG_SRAM2_AHB_NS
#define RAMCFG_SRAM2_AHB_BASE     RAMCFG_SRAM2_AHB_BASE_NS

#define RAMCFG_VENC_RAM           RAMCFG_VENC_RAM_NS
#define RAMCFG_VENC_RAM_BASE      RAMCFG_VENC_RAM_BASE_NS

#define RAMCFG_BKPSRAM            RAMCFG_BKPSRAM_NS
#define RAMCFG_BKPSRAM_BASE       RAMCFG_BKPSRAM_BASE_NS

#define RAMCFG_FLEXRAM            RAMCFG_FLEXRAM_NS
#define RAMCFG_FLEXRAM_BASE       RAMCFG_FLEXRAM_BASE_NS

#define RCC                       RCC_NS
#define RCC_BASE                  RCC_BASE_NS

#define RIFSC                     RIFSC_NS
#define RIFSC_BASE                RIFSC_BASE_NS

#define RISAF1                    RISAF1_NS
#define RISAF1_BASE               RISAF1_BASE_NS

#define RISAF2                    RISAF2_NS
#define RISAF2_BASE               RISAF2_BASE_NS

#define RISAF3                    RISAF3_NS
#define RISAF3_BASE               RISAF3_BASE_NS

#define RISAF4                    RISAF4_NS
#define RISAF4_BASE               RISAF4_BASE_NS

#define RISAF5                    RISAF5_NS
#define RISAF5_BASE               RISAF5_BASE_NS

#define RISAF6                    RISAF6_NS
#define RISAF6_BASE               RISAF6_BASE_NS

#define RISAF7                    RISAF7_NS
#define RISAF7_BASE               RISAF7_BASE_NS

#define RISAF8                    RISAF8_NS
#define RISAF8_BASE               RISAF8_BASE_NS

#define RISAF9                    RISAF9_NS
#define RISAF9_BASE               RISAF9_BASE_NS

#define RISAF11                   RISAF11_NS
#define RISAF11_BASE              RISAF11_BASE_NS

#define RISAF12                   RISAF12_NS
#define RISAF12_BASE              RISAF12_BASE_NS

#define RISAF13                   RISAF13_NS
#define RISAF13_BASE              RISAF13_BASE_NS

#define RISAF14                   RISAF14_NS
#define RISAF14_BASE              RISAF14_BASE_NS

#define RISAF15                   RISAF15_NS
#define RISAF15_BASE              RISAF15_BASE_NS

#define RISAF21                   RISAF21_NS
#define RISAF21_BASE              RISAF21_BASE_NS

#define RISAF22                   RISAF22_NS
#define RISAF22_BASE              RISAF22_BASE_NS

#define RISAF23                   RISAF23_NS
#define RISAF23_BASE              RISAF23_BASE_NS

#define RNG                       RNG_NS
#define RNG_BASE                  RNG_BASE_NS

#define RTC                       RTC_NS
#define RTC_BASE                  RTC_BASE_NS


#define SAI1                      SAI1_NS
#define SAI1_BASE                 SAI1_BASE_NS

#define SAI1_Block_A              SAI1_Block_A_NS
#define SAI1_Block_A_BASE         SAI1_Block_A_BASE_NS

#define SAI1_Block_B              SAI1_Block_B_NS
#define SAI1_Block_B_BASE         SAI1_Block_B_BASE_NS

#define SAI2                      SAI2_NS
#define SAI2_BASE                 SAI2_BASE_NS

#define SAI2_Block_A              SAI2_Block_A_NS
#define SAI2_Block_A_BASE         SAI2_Block_A_BASE_NS

#define SAI2_Block_B              SAI2_Block_B_NS
#define SAI2_Block_B_BASE         SAI2_Block_B_BASE_NS

#define SDMMC1                    SDMMC1_NS
#define SDMMC1_BASE               SDMMC1_BASE_NS

#define SDMMC2                    SDMMC2_NS
#define SDMMC2_BASE               SDMMC2_BASE_NS

#define SPDIFRX                   SPDIFRX_NS
#define SPDIFRX_BASE              SPDIFRX_BASE_NS

#define SPI1                      SPI1_NS
#define SPI1_BASE                 SPI1_BASE_NS

#define SPI2                      SPI2_NS
#define SPI2_BASE                 SPI2_BASE_NS

#define SPI3                      SPI3_NS
#define SPI3_BASE                 SPI3_BASE_NS

#define SPI4                      SPI4_NS
#define SPI4_BASE                 SPI4_BASE_NS

#define SPI5                      SPI5_NS
#define SPI5_BASE                 SPI5_BASE_NS

#define SPI6                      SPI6_NS
#define SPI6_BASE                 SPI6_BASE_NS

#define SRAMCAN_BASE              SRAMCAN_BASE_NS

#define SYSCFG                    SYSCFG_NS
#define SYSCFG_BASE               SYSCFG_BASE_NS

#define TAMP                      TAMP_NS
#define TAMP_BASE                 TAMP_BASE_NS

#define TIM1                      TIM1_NS
#define TIM1_BASE                 TIM1_BASE_NS

#define TIM2                      TIM2_NS
#define TIM2_BASE                 TIM2_BASE_NS

#define TIM3                      TIM3_NS
#define TIM3_BASE                 TIM3_BASE_NS

#define TIM4                      TIM4_NS
#define TIM4_BASE                 TIM4_BASE_NS

#define TIM5                      TIM5_NS
#define TIM5_BASE                 TIM5_BASE_NS

