micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n647xx.h
#define IS_GPDMA_INSTANCE(INSTANCE)  (((INSTANCE) == GPDMA1_Channel0_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel1_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel2_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel3_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel4_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel5_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel6_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel7_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel8_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel9_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel10_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel11_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel12_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel13_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel14_NS) || \
                                      ((INSTANCE) == GPDMA1_Channel15_NS))

#define IS_HPDMA_INSTANCE(INSTANCE)  (((INSTANCE) == HPDMA1_Channel0_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel1_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel2_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel3_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel4_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel5_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel6_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel7_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel8_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel9_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel10_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel11_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                      ((INSTANCE) == HPDMA1_Channel15_NS))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel12_NS) || \
                                                 ((INSTANCE) == GPDMA1_Channel13_NS) || \
                                                 ((INSTANCE) == GPDMA1_Channel14_NS) || \
                                                 ((INSTANCE) == GPDMA1_Channel15_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel15_NS))

#define IS_DMA_LIMIT_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12_NS) || ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel14_NS) || ((INSTANCE) == HPDMA1_Channel15_NS))

#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0_NS)  || \
                                         ((INSTANCE) == GPDMA1_Channel1_NS)  || \
                                         ((INSTANCE) == GPDMA1_Channel15_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel0_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel1_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel15_NS))

/******************************* DMA2D Instances *****************************/
#define IS_DMA2D_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DMA2D_NS)

/******************************* DTS Instances *****************************/
#define IS_DTS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DTS_NS)

/******************************* ETH Instances *******************************/
#define IS_ETH_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ETH1_NS)

/******************************* FDCAN Instances *****************************/
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_NS) || \
                                         ((INSTANCE) == FDCAN2_NS) || \
                                         ((INSTANCE) == FDCAN3_NS))

#define IS_FDCAN_TT_INSTANCE(__INSTANCE__) ((__INSTANCE__) == FDCAN1_NS)

/******************************* GFXMMU Instance *****************************/
#define IS_GFXMMU_ALL_INSTANCE(INSTANCE) ((INSTANCE) == GFXMMU_NS)

/******************************* GFXTIM Instance *****************************/
#define IS_GFXTIM_ALL_INSTANCE(INSTANCE) ((INSTANCE) == GFXTIM_NS)

/********************************* GPIO Instances ****************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA_NS) || \
                                        ((INSTANCE) == GPIOB_NS) || \
                                        ((INSTANCE) == GPIOC_NS) || \
                                        ((INSTANCE) == GPIOD_NS) || \
                                        ((INSTANCE) == GPIOE_NS) || \
                                        ((INSTANCE) == GPIOF_NS) || \
                                        ((INSTANCE) == GPIOG_NS) || \
                                        ((INSTANCE) == GPIOH_NS) || \
                                        ((INSTANCE) == GPION_NS) || \
                                        ((INSTANCE) == GPIOO_NS) || \
                                        ((INSTANCE) == GPIOP_NS) || \
                                        ((INSTANCE) == GPIOQ_NS))

/******************************* GPIO AF Instances ***************************/
/* All GPIO Banks support AF */
#define IS_GPIO_AF_INSTANCE(INSTANCE)   IS_GPIO_ALL_INSTANCE(INSTANCE)

